# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2,1,2]] # 7-P5/32
  - [-1, 2, C3k2, [384, True]]
  - [-1, 1, SPPF, [384, 5]] # 9
  - [-1, 2, C2PSA, [384]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # - [-1, 1, DySample, []]
  - [[-1, 6,4], 1, EdgeCon, [True,0.6]] # cat backbone P4
  - [-1, 3, C3k2, [512, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # - [-1, 1, DySample, []]
  - [[-1, 4,2], 1, EdgeCon, [True,0.8]] # cat backbone P3
  - [-1, 3, C3k2, [256, False]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # - [-1, 1, DySample, []]
  - [[-1, 2,1], 1, EdgeCon, [False,1]] # cat backbone P3
  - [-1, 3, C3k2, [128, False]] # 18 (P3/8-small)


  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3k2, [256, False]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3k2, [512, False]] # 24 (P5/32-large)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  # - [-1, 3, C2f, [512]] # 27 (P5/64-huge)

  - [-1, 1, CED, [384]] # 28 (P5/64-huge)
  - [-1, 1, Conv, [128, 1, 1]]
  - [-2, 1, Conv, [256, 1, 1]]
  # - [-3, 1, Conv, [512, 1, 1]]

  # - [[28,18], 1, CoordAttMapD, [16,"avg","dysample",8]] #30
  # - [[29,21], 1, CoordAttMapD, [16,"avg","dysample",4]] 
  # - [-2, 1, SKAttention, [[3,5,7],False]] #32
  # - [-2, 1, SKAttention, [[3,5],False]] #33

  - [[29,19],1,ForeheadAlign,[16,"avg","nearest",8,[3,5,7],False]] #31
  - [[30,22],1,ForeheadAlign,[16,"avg","nearest",4,[3,5],False]] #32

  - [[2,4,6,19,22,25],1,MultiScaleDistillLoss,[False]] #33


  - [[31,32,25,33], 1,Detect, [nc]] # Detect(P3, P4, P5)
